In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

# Задание 1 

Рассмотрим 2 таблицы

A

|   name  |  key   | value
|---------|--------- | ----
| Ivanov  |   FIO  |  Иванов Иван Иванович
| Ivanov  | Phone  |  +(7) 111-1111111
| Ivanov  | email  | ivanov@ivanov.com
| Petrov  |   FIO  | Петров Петр Петрович
| Petrov  | Phone  |  +(7) 222-2222222
| Petrov  | email  | petrov@petrov.com

B

|   name  |  FIO   | Phone | email
|---------|---------|------|---
| Ivanov  | Иванов Иван Иванович | +(7) 111-1111111 | ivanov@ivanov.com
| Petrov  | Петров Петр Петрович | +(7) 222-2222222 | petrov@petrov.com


1. Как из таблицы A получить B?
2. Как из таблицы B получить A?

In [2]:
%%sql
DROP TABLE IF EXISTS TableA

 * sqlite://
Done.

[]

In [3]:
%%sql
CREATE TABLE TableA
(
    name varchar(50),
    key varchar(50),
    value varchar(50),
    CONSTRAINT new_pk PRIMARY KEY (name, key)
)

 * sqlite://
Done.

[]

In [4]:
%%sql
INSERT INTO TableA (name, key, value) VALUES ('Ivanov', 'FIO', 'Иванов Иван Иванович');
INSERT INTO TableA (name, key, value) VALUES ('Ivanov', 'Phone', '+(7) 111-1111111');
INSERT INTO TableA (name, key, value) VALUES ('Ivanov', 'email', 'ivanov@ivanov.com');
INSERT INTO TableA (name, key, value) VALUES ('Petrov', 'FIO', 'Петров Петр Петрович');
INSERT INTO TableA (name, key, value) VALUES ('Petrov', 'Phone', '+(7) 222-2222222');
INSERT INTO TableA (name, key, value) VALUES ('Petrov', 'email', 'petrov@petrov.com');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql
SELECT *
FROM TableA

 * sqlite://
Done.

[('Ivanov', 'FIO', 'Иванов Иван Иванович'),
 ('Ivanov', 'Phone', '+(7) 111-1111111'),
 ('Ivanov', 'email', 'ivanov@ivanov.com'),
 ('Petrov', 'FIO', 'Петров Петр Петрович'),
 ('Petrov', 'Phone', '+(7) 222-2222222'),
 ('Petrov', 'email', 'petrov@petrov.com')]

In [6]:
%%sql

SELECT value
               FROM TableA
               WHERE key = 'FIO'

 * sqlite://
Done.

[('Иванов Иван Иванович',), ('Петров Петр Петрович',)]

In [7]:
%%sql

WITH 
Tname AS (SELECT DISTINCT name
          FROM TableA),
TFIO AS (SELECT name, value
         FROM TableA
         WHERE key = 'FIO'),
TPhone AS (SELECT name, value
           FROM TableA
           WHERE key = 'Phone'),
Temail AS (SELECT name, value
           FROM TableA
           WHERE key = 'email')

SELECT TN.name AS NAME, TF.value AS FIO, TP.value AS Phone, TE.value AS email
FROM Tname AS TN
INNER JOIN TFIO AS TF ON TN.name = TF.name
INNER JOIN TPhone AS TP ON TN.name = TP.name
INNER JOIN Temail AS TE ON TN.name = TE.name

 * sqlite://
Done.

[('Ivanov', 'Иванов Иван Иванович', '+(7) 111-1111111', 'ivanov@ivanov.com'),
 ('Petrov', 'Петров Петр Петрович', '+(7) 222-2222222', 'petrov@petrov.com')]

In [8]:
%%sql

WITH 
Tname AS (SELECT DISTINCT name
          FROM TableA),
TFIO AS (SELECT name, value
         FROM TableA
         WHERE key = 'FIO'),
TPhone AS (SELECT name, value
           FROM TableA
           WHERE key = 'Phone'),
Temail AS (SELECT name, value
           FROM TableA
           WHERE key = 'email')

SELECT TN.name AS NAME, TF.value AS FIO, TP.value AS Phone, TE.value AS email
FROM Tname AS TN, TFIO AS TF, TPhone AS TP, Temail AS TE
WHERE TN.name = TF.name
AND TN.name = TP.name
AND TN.name = TE.name

 * sqlite://
Done.

[('Ivanov', 'Иванов Иван Иванович', '+(7) 111-1111111', 'ivanov@ivanov.com'),
 ('Petrov', 'Петров Петр Петрович', '+(7) 222-2222222', 'petrov@petrov.com')]

In [9]:
%%sql
DROP TABLE IF EXISTS TableB

 * sqlite://
Done.

[]

In [10]:
%%sql
CREATE TABLE TableB
(
    name varchar(50) PRIMARY KEY,
    FIO varchar(50),
    Phone varchar(50),
    email varchar(50)
)

 * sqlite://
Done.

[]

In [11]:
%%sql
INSERT INTO TableB (name, FIO, Phone, email) VALUES ('Ivanov', 'Иванов Иван Иванович', '+(7) 111-1111111','ivanov@ivanov.com');
INSERT INTO TableB (name, FIO, Phone, email)  VALUES ('Petrov', 'Петров Петр Петрович', '+(7) 222-2222222', 'petrov@petrov.com');

 * sqlite://
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql
SELECT *
FROM TableB

 * sqlite://
Done.

[('Ivanov', 'Иванов Иван Иванович', '+(7) 111-1111111', 'ivanov@ivanov.com'),
 ('Petrov', 'Петров Петр Петрович', '+(7) 222-2222222', 'petrov@petrov.com')]

In [13]:
%%sql
SELECT name, 'FIO' AS key, FIO AS value
FROM TableB
UNION
SELECT name, 'Phone' AS key, Phone AS value
FROM TableB
UNION
SELECT name, 'email' AS key, email AS value
FROM TableB

 * sqlite://
Done.

[('Ivanov', 'FIO', 'Иванов Иван Иванович'),
 ('Ivanov', 'Phone', '+(7) 111-1111111'),
 ('Ivanov', 'email', 'ivanov@ivanov.com'),
 ('Petrov', 'FIO', 'Петров Петр Петрович'),
 ('Petrov', 'Phone', '+(7) 222-2222222'),
 ('Petrov', 'email', 'petrov@petrov.com')]

# Задание 2
Рассмотрим таблицу StudentMarks

| student_name | mark_date | mark_value
|---------|--------- | ----
| Ivanov  | 2019.01.01 | 3
| Ivanov  | 2019.01.05 | 4
| Ivanov  | 2019.02.03 | 5
| Petrov  | 2019.02.01 | 2
| Petrov  | 2019.02.16 | 4
| Petrov  | 2019.04.17 | 5

В данной таблице студенту проставляется оценка за определенную дату. Необходимо сформировать интервалы, 
за время которых оценка не менялась,
и среднюю оценку, находящуюся в данном интервале.
Текущий интервал должен заканчиваться на 5999.12.31


По исходным данным результатом таблицы будет следущее:

| client_name | mark_validfrom | mark_validto | average_mark_value
|---------|--------- | ------ | -----
| Ivanov  | 2019.01.01 | 2019.01.04 | 3
| Ivanov  | 2019.01.05 | 2019.02.02 | 3.5
| Ivanov  | 2019.02.03 | 5999.12.31 | 4
| Petrov  | 2019.02.01 | 2019.02.15 | 2
| Petrov  | 2019.02.16 | 2019.04.16 | 3
| Petrov  | 2019.04.17 | 5999.12.31 | 3.6666

In [14]:
%%sql
DROP TABLE IF EXISTS StudentMarks

 * sqlite://
Done.

[]

In [15]:
%%sql
CREATE TABLE StudentMarks
(
    student_name varchar(50),
    mark_date date,
    mark_value integer
)

 * sqlite://
Done.

[]

In [16]:
%%sql
INSERT INTO StudentMarks (student_name, mark_date, mark_value) VALUES ('Ivanov', date('2019-01-01'), 3);
INSERT INTO StudentMarks (student_name, mark_date, mark_value) VALUES ('Ivanov', date('2019-01-05'), 4);
INSERT INTO StudentMarks (student_name, mark_date, mark_value) VALUES ('Ivanov', date('2019-02-03'), 5);
INSERT INTO StudentMarks (student_name, mark_date, mark_value) VALUES ('Petrov', date('2019-02-01'), 2);
INSERT INTO StudentMarks (student_name, mark_date, mark_value) VALUES ('Petrov', date('2019-02-16'), 4);
INSERT INTO StudentMarks (student_name, mark_date, mark_value) VALUES ('Petrov', date('2019-04-17'), 5);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
SELECT *
FROM StudentMarks

 * sqlite://
Done.

[('Ivanov', '2019-01-01', 3),
 ('Ivanov', '2019-01-05', 4),
 ('Ivanov', '2019-02-03', 5),
 ('Petrov', '2019-02-01', 2),
 ('Petrov', '2019-02-16', 4),
 ('Petrov', '2019-04-17', 5)]

In [18]:
%%sql
WITH Table1 AS 
    (SELECT student_name, mark_date,
     LEAD (date(mark_date, '-1 day')) OVER (PARTITION BY student_name ORDER BY student_name, mark_date) AS mark_validto,
     AVG(mark_value) OVER (PARTITION BY student_name ORDER BY student_name, mark_date) AS avg_mark_value
     FROM StudentMarks)
SELECT student_name, mark_date,
CASE 
    WHEN mark_validto IS NULL THEN date('5999-12-31')
    ELSE mark_validto
END AS mark_validto,
avg_mark_value
FROM Table1 AS T1

 * sqlite://
Done.

[('Ivanov', '2019-01-01', '2019-01-04', 3.0),
 ('Ivanov', '2019-01-05', '2019-02-02', 3.5),
 ('Ivanov', '2019-02-03', '5999-12-31', 4.0),
 ('Petrov', '2019-02-01', '2019-02-15', 2.0),
 ('Petrov', '2019-02-16', '2019-04-16', 3.0),
 ('Petrov', '2019-04-17', '5999-12-31', 3.6666666666666665)]

# Задание 3


Рассмотрим таблицу CheatList, описывающий блокнот со шпаргалками. В данной таблице на одном листе может быть только одна шпаргалка по одному предмету. Блокнот состоит из 2N листов, пронумерованных от 0 до 2N-1. 0 лист всегда пустой, 2N-1 лист может быть как пустым, так и заполненным. В самом конце блокнота не может быть 2 подряд пустых листа. Необходимо вернуть таблицу вида (left_list, right_list), описывающий все листы в отсортированном порядке
## Пример 

| ListNumber | Subject 
| -----------|--------
|  1         | Math
|  3         | Math
|  4         | History

## Результат

| left_list | righ_list 
| --------- | ---------
|   NULL    |  Math
|   NULL    |  Math
|   History |  NULL

In [36]:
%%sql
DROP TABLE IF EXISTS CheatList

 * sqlite://
Done.

[]

In [37]:
%%sql
CREATE TABLE CheatList
(
    ListNumber integer(0,0),
    Subject varchar(0, 0)
)

 * sqlite://
Done.

[]

In [38]:
%%sql
INSERT INTO CheatList (ListNumber, Subject) VALUES (1, 'English');
INSERT INTO CheatList (ListNumber, Subject) VALUES (3, 'English');
INSERT INTO CheatList (ListNumber, Subject) VALUES (4, 'Hystory');
INSERT INTO CheatList (ListNumber, Subject) VALUES (5, 'Hystory');
INSERT INTO CheatList (ListNumber, Subject) VALUES (6, 'Hystory');
INSERT INTO CheatList (ListNumber, Subject) VALUES (7, 'Math');
INSERT INTO CheatList (ListNumber, Subject) VALUES (8, 'Math');
INSERT INTO CheatList (ListNumber, Subject) VALUES (9, 'Math');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [39]:
%%sql
SELECT *
FROM CheatList

 * sqlite://
Done.

[(1, 'English'),
 (3, 'English'),
 (4, 'Hystory'),
 (5, 'Hystory'),
 (6, 'Hystory'),
 (7, 'Math'),
 (8, 'Math'),
 (9, 'Math')]

In [40]:
%%sql
SELECT 
    MAX(CASE WHEN ListNumber%2 THEN NULL ELSE Subject END) AS left_list,
    MAX(CASE WHEN ListNumber%2 THEN Subject ELSE NULL END) AS right_list
FROM CheatList
GROUP BY ListNumber

 * sqlite://
Done.

[(None, 'English'),
 (None, 'English'),
 ('Hystory', None),
 (None, 'Hystory'),
 ('Hystory', None),
 (None, 'Math'),
 ('Math', None),
 (None, 'Math')]

# Задание 4
Используя формат xml, описанный в [dbmstools](http://dbmstools.sourceforge.net/docs/xmlschema.html), напишите функцию на языке Python, на входе которой будет путь к xml, на выходе - скрипт с DDL скриптами таблиц (можно ограничиться table блоком)

In [41]:
from xml.dom import minidom

#создаём объект
doc = minidom.Document()

#корневой тег root
root = doc.createElement('root')
doc.appendChild(root)

name = doc.createElement('name')
text = doc.createTextNode('Students')
name.appendChild(text)
root.appendChild(name)

#первый блок student
student = doc.createElement('student')
student.setAttribute('color', 'white')

faculty = doc.createElement('faculty')
text = doc.createTextNode('Cybernetics')
faculty.appendChild(text)
faculty.setAttribute('color', 'green')
student.appendChild(faculty)

course = doc.createElement('course')
text = doc.createTextNode('2')
course.appendChild(text)
course.setAttribute('color', 'white')
student.appendChild(course)

average_mark = doc.createElement('average_mark')
text = doc.createTextNode('5')
average_mark.appendChild(text)
average_mark.setAttribute('red', 'green')
student.appendChild(average_mark)

root.appendChild(student)


#второй блок student
student = doc.createElement('student')
student.setAttribute('color', 'white')

faculty = doc.createElement('faculty')
text = doc.createTextNode('IT')
faculty.appendChild(text)
faculty.setAttribute('color', 'green')
student.appendChild(faculty)

course = doc.createElement('course')
text = doc.createTextNode('3')
course.appendChild(text)
course.setAttribute('color', 'white')
student.appendChild(course)

average_mark = doc.createElement('average_mark')
text = doc.createTextNode('3')
average_mark.appendChild(text)
average_mark.setAttribute('red', 'green')
student.appendChild(average_mark)

root.appendChild(student)

#запись в файл
xml_str = doc.toprettyxml(indent="  ")
with open("student.xml", "w") as f:
    f.write(xml_str)

In [42]:
from xml.dom import minidom

doc = minidom.parse("student.xml")
name = doc.getElementsByTagName("name")[0]
print(name.firstChild.data)

student = doc.getElementsByTagName("student")
for st in student:
    faculty = st.getElementsByTagName("faculty")[0]
    course = st.getElementsByTagName("course")[0]
    average_mark = st.getElementsByTagName("average_mark")[0]
    print("Факультет: %s, курс: %s, средний балл: %s" % (faculty.firstChild.data,\
    course.firstChild.data, average_mark.firstChild.data))

Students
Факультет: Cybernetics, курс: 2, средний балл: 5
Факультет: IT, курс: 3, средний балл: 3

# Задание 5
Необходимо уметь хранить матрицы MxM внутри СУБД. Предложите способ хранения, и приведите пример перемножения двух матриц средствами SQL

In [77]:
%%sql
DROP TABLE IF EXISTS Matrix;

 * sqlite://
Done.

[]

In [78]:
%%sql
CREATE TABLE Matrix
(
    Row INT NOT NULL,
    Column INT NOT NULL,
    Value1 INT NOT NULL,
    Value2 INT NOT NULL
);

 * sqlite://
Done.

[]

In [79]:
%%sql 
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (1, 1, 0, 1);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (1, 2, 1, 3);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (1, 3, 1, 8);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (1, 4, 4, 4);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (2, 1, 2, 4);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (2, 2, 0, 1);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (2, 3, 1, 1);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (2, 4, 2, 5);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (3, 1, 1, 2);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (3, 2, 0, 8);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (3, 3, 0, 6);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (3, 4, 2, 2);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (4, 1, 2, 2);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (4, 2, 3, 3);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (4, 3, 1, 1);
INSERT INTO Matrix (Row, Column, Value1, Value2) VALUES (4, 4, 4, 1)

-- 0 1 1 4   1 3 8 4
-- 2 0 1 2   4 1 1 5
-- 1 0 0 2   2 8 6 2
-- 2 3 1 4   2 3 1 1

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [86]:
%%sql
SELECT M1.Row, M2.Column, SUM(M1.Value1*M2.Value2) AS M3
FROM Matrix M1 
JOIN Matrix M2 ON M1.Column = M2.Row
GROUP BY M1.Row, M2.Column
ORDER BY M1.Row, M2.Column;

 * sqlite://
Done.

[(1, 1, 14),
 (1, 2, 21),
 (1, 3, 11),
 (1, 4, 11),
 (2, 1, 8),
 (2, 2, 20),
 (2, 3, 24),
 (2, 4, 12),
 (3, 1, 5),
 (3, 2, 9),
 (3, 3, 10),
 (3, 4, 6),
 (4, 1, 24),
 (4, 2, 29),
 (4, 3, 29),
 (4, 4, 29)]